Revit 2026 API

# AnalysisDisplayStyleVectorPosition Enumeration

---

Defines vector position for vector settings of analysis display style.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum AnalysisDisplayStyleVectorPosition
```
```vb
Public Enumeration AnalysisDisplayStyleVectorPosition
```
```cpp
public enum class AnalysisDisplayStyleVectorPosition
```
```fsharp
type AnalysisDisplayStyleVectorPosition
```

| Member name | Value | Description |
| --- | --- | --- |
| FromDataPoint | 1 |  |
| ToDataPoint | 0 |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace